Repository: sirlucjan/local-repo
Catalog: share/translations/*.po
Languages: pl

source: This program helps to manage local repositories. Specify the path to the repository with the first argument. If no option is specified, some repo information will be printed.
pl: Ten program pomaga zarządzać lokalnymi repozytoriami. Określ ścieżkę do repozytorium jako pierwszy argument. Jeżeli nie zostanie podana żadna opcja, wyświetlone będą informacje o repozytorium.

source: %(prog)s path [options]
pl: %(prog)s ścieżka [opcje]

source: path
pl: ścieżka

source: path to the repo or the repo name if set up in your config file '{0}'
pl: ścieżka do repozytorium lub jego nazwa, jeżeli określono ją w pliku konfiguracyjnym '{0}'

source: add a package to the repo - path can point to a local or remote package file, pkgbuild file or pkgbuild tarball - supported protocols are HTTP(S) and FTP
pl: dodaj pakiet do repozytorium - ścieżka może prowadzić do pliku lokalnego lub zdalnego, pakietu lub archiwum tar (tarball) - wspierany jest protokół HTTP(S) i FTP

source: name
pl: nazwa

source: download, build and add a package from the AUR to the repo
pl: pobierz, zbuduj i dodaj pakiet z AUR do repozytorium

source: rebuild specified packages - NOTE: the 'pkgbuild' path must be set up in the config file
pl: przebuduj wybrane pakiety - UWAGA: ścieżka do 'pkgbuild' musi być określona w pliku konfiguracyjnym

source: run an integrity check
pl: uruchom sprawdzanie integralności

source: clear the cache
pl: wyczyść pamięć podręczną

source: the elephant never forgets
pl: słoń nigdy nie zapomina

source: force an operation - use this with -a or --add to up-/downgrade a package
pl: wymuś operację - użyj z -a lub --add do aktualizacji/dezaktualizacji pakietu

source: use an alternative config file (instead of '{0}')
pl: użyj innego pliku konfiguracyjnego (zamiast '{0}')

source: display info for specified packages
pl: wyświetl informacje o wybranych pakietach

source: list all packages from the repo
pl: wyświetl listę pakietów z repozytorium

source: remove packages from the repo
pl: usuń pakiet z repozytorium

source: restore repo database
pl: przywróć bazę danych repozytorium

source: term
pl: fraza

source: find packages
pl: znajdź pakiety

source: upgrade all packages in the repo, which are available in the AUR
pl: uaktualnij wszystkie pakiety w repozytorium, dostępne w AUR

source: upgrade all packages in the repo, which are based on a VCS and available in the AUR
pl: uaktualnij wszystkie pakiety w repozytorium, bazujące na VCS i dostępne w AUR

source: Could not reach the AUR
pl: Nie można uzyskać dostępu do AUR

source: AUR responded with error: {0}
pl: AUR zwrócił błąd: {0}

source: AUR responded with invalid data
pl: AUR zwrócił błędne dane

source: Could not open config file: {0}
pl: Nie można otworzyć pliku konfiguracyjnego: {0}

source: Could not parse config file: {0}
pl: Nie można przetworzyć pliku konfiguracyjnego: {0}

source: Could not save config file: {0}
pl: Nie można zapisać pliku konfiguracyjnego: {0}

source: Execution cancelled by user
pl: Działanie przerwane przez użytkownika

source: Loading repo: {0}
pl: Wczytywanie repozytorium: {0}

source: This repo has no packages
pl: To repozytorium nie zawiera żadnych pakietów

source: Package does not exist: {0}
pl: Pakiet: {0} nie istnieje

source: Package information: {0}
pl: Informacje o pakiecie: {0}

source: No package found
pl: Brak pakietów

source: Need following packages as dependencies: [{0}]
pl: Wymagane są następujące pakiety jako zależności: [{0}]

source: Install?
pl: Zainstalować?

source: Try without installing dependencies?
pl: Spróbować instalacji bez zależności?

source: Bye
pl: Narka

source: Installed following packages as dependencies: [{0}]
pl: Zainstalowano następujące pakiety jako zależności: [{0}]

source: Uninstall?
pl: Odinstalować?

source: Forging a new package: {0}
pl: Tworzenie nowego pakietu: {0}

source: Adding package to the repo: {0}
pl: Dodawanie pakietu do repozytorium: {0}

source: Added Package: {0} {1}
pl: Dodano pakiet: {0} {1}

source: Please specify 'pkgbuild' in your config file!
pl: Proszę określić ścieżkę do 'pkgbuild' w pliku konfiguracyjnym!

source: Packages do not exist: {0}
pl: Pakiety: {0} nie isnieją

source: Removing packages: {0}
pl: Usuwanie pakietów: {0}

source: Removed packages: {0}
pl: Usunięto pakiety: {0}

source: Retrieving package info from the AUR
pl: Pobieranie informacji o pakiecie z AUR

source: Package is already in the repo: {0}
pl: Pakiet: {0} znajduje się już w repozytorium

source: {0} packages found
pl: znaleziono {0} pakietów

source: Starting an AUR upgrade
pl: Uruchamianie aktualizacji z AUR

source: Nothing to do
pl: Nie ma nic do zrobienia

source: Checking for updates
pl: Sparwdzanie aktualizacji

source: All packages are up to date
pl: Wszystkie pakiety zostały zaktualizowane

source: Upgrade?
pl: Zaktualizować?

source: Updating all VCS packages
pl: Aktualizacja wszyskich pakietów VCS

source: Starting a VCS upgrade
pl: Uruchamianie aktualizacji VCS

source: No VCS packages found
pl: NIe znaleziono pakietów VCS

source: No updates found
pl: Brak aktualizacji

source: Clearing the cache
pl: Czyszczenie pamięci podręcznej

source: Cleared cache
pl: Oczyszczono pamięć podręczną

source: Running integrity check
pl: Uruchamienie sprawdzanie integralności

source: No errors found
pl: Nie znaleziono błędów

source: Finished integrity check without any errors
pl: Podczas sprawdzania integralności nie wystąpiły żadne błędy

source: Finished integrity check with errors:
pl: Podczas sprawdzania integralności wystąpiły błędy:

source: Restoring database
pl: Odzyskiwanie bazy danych

source: Restored Database
pl: Odzyskano bazę danych

source: Could not open log file: {0}
pl: Nie można otworzyć pliku .log: {0}

source: [Error] {0}
pl: [Błąd] {0}

source: Could not store log file: {0} -> {1}
pl: Nie można zachować pliku .log: {0} -> {1}

source: Could not copy PKGBUILD dir: {0} -> {1}
pl: Nie można skopiować katalogu PKGBUILD-ów: {0} -> {1}

source: Unresolved dependencies: {0}
pl: Nierozwiązane zależności: {0}

source: Could not download file: {0}
pl: Nie można pobrać pliku: {0}

source: Could not open tarball: {0}
pl: Nie można otworzyć archiwum tar (tarball): {0}

source: Tarball contains bad member: {0}
pl: Archiwum tar (tarball): {0} zawiera błędny element

source: Could not extract tarball: {0}
pl: Nie można rozpakować archiwum tar (tarball): {0}

source: Could not list directory: {0}
pl: Nie można wyświetlić zawartości katalogu: {0}

source: Could not find PKGBUILD: {0}
pl: Nie można zanleżć PKGBUILD-u: {0}

source: Could not find any package: {0}
pl: Nie można znaleźć żadnego pakietu: {0}

source: File does not exist: {0}
pl: Plik: {0} nie istnieje

source: Could not read package info: {0}
pl: Nie można odczytać informacji o pakiecie: {0}

source: An error occurred in tar
pl: Pojawił się błąd w pliku .tar

source: Could not determine package size: {0}
pl: Nie można określić wielkości pakietu: {0}

source: Could not calculate package checksums: {0}
pl: Nie można wyliczyć sum kontrolnych pakietu: {0}

source: Invalid file name: {0}
pl: Błędna nazwa pliku: {0}

source: Destination is no directory: {0}
pl: {0} nie jest katalogiem

source: File already exists: {0}
pl: Plik: {0} już istnieje

source: Could not move package: {0} -> {1}
pl: Nie można przenieść pakietu: {0} -> {1}

source: Could not move sig file: {0} -> {1}
pl: Nie można przenieść pliku .sig: {0} -> {1}

source: Could not remove package: {0}
pl: Nie można usunąć pakietu: {0}

source: An error occurred while running: {0}
pl: Wystąpił błąd podczas uruchamiania: {0}

source: Could not change working directory: {0}
pl: Nie można zmienić katalogu roboczego: {0}

source: Ooh no! Somebody killed the repo elephant
pl: O nie! Ktoś zabił repo-słonia

source: Could not parse PKGBUILD: {0}
pl: Nie można przetworzyć PKGBUILD-u: {0}

source: Missing PKGBUILD entry: {0}
pl: Brakuje pozycji PKGBUILD: {0}

source: Missing PKGINFO entry: {0}
pl: Brakuje pozycji PKGINFO: {0}

source: Missing fields: {0}
pl: Bakujące pola: {0}

source: Could not add packages to the db: {0}
pl: Nie można dodać pakietu: {0} do bazy danych

source: Could not remove packages from the db: {0}
pl: Nie można usunąć pakietu: {0} z bazy danych

source: Package has no valid checksum: {0}
pl: Pakiet {0} nie posiada ważnych sum kontrolnych:

source: Missing signature for package: {0}
pl: Brakuje podpisu dla pakietu: {0}

source: Package is not listed in repo database: {0}
pl: Pakiet: {0} nie znajduje się w bazie danych repozytorium

source: Could not find database: {0}
pl: Nie można odnaleźć bazy danych: {0}

source: Could not open database: {0}
pl: Nie można otworzyć bazy danych: {0}

source: Invalid db entry: {0}: {1}
pl: Błędna pozycja w bazie danych: {0}: {1}

source: Could not read db entry: {0}
pl: Nie można odczytać pozycji w bazie danych: {0}

source: Could not close database: {0}
pl: Nie można zamknąć bazy danych: {0}

source: Could not remove database: {0}
pl: Nie można usunąć bazy danych: {0}

source: Cache is outdated: {0}
pl: Pamięć podręczna jest niekatualna: {0}

source: Could not load cache: {0}
pl: Nie można wczytać pamięci podręcznej: {0}

source: Could not update cache: {0}
pl: Nie można uaktualnić pamięci podręcznej: {0}

source: Could not clear cache: {0}
pl: Nie można oczyścić pamięci podręcznej: {0}

source: [y|N]
pl: [t|N]

source: y
pl: t

source: yes
pl: tak

source: Architecture
pl: Architektura

source: Bugs
pl: Błędy

source: Build Date
pl: Data budowania

source: Package size
pl: Wielkość pakietu

source: Description
pl: Opis

source: Filename
pl: Nazwa pliku

source: Installed size
pl: Wielkość instalacji

source: Last update
pl: Ostatnia aktualizacja

source: License
pl: Licencja

source: Location
pl: Lokacja

source: MD5sum
pl: suma MD5

source: Name
pl: Nazwa

source: Packager
pl: Pakujący

source: Packages
pl: Pakiety

source: Signed
pl: Podpisane

source: SHA256sum
pl: suma SHA256

source: Translations
pl: Tłumaczenia

source: Version
pl: Wersja

source: Website
pl: Strona internetowa

source: Yes
pl: Tak

source: No
pl: Nie

source: usage:
pl: użycie:

source: positional arguments
pl: argumenty pozycyjne

source: optional arguments
pl: argumenty opcjonalne

source: show this help message and exit
pl: wyświetla pomoc

source: too few arguments
pl: zbyt mało argumentów

source: unrecognized arguments: %s
pl: nierozpoznane argumenty: %s

source: expected at least one argument
pl: oczekiwano przynajmniej jednego argumentu

source: %(prog)s: error: %(message)s
pl: %(prog)s: błąd: %(message)s
